# Проект "Викторина Знаний"
import random
import time

def display_categories(questions):
    num = 0
    for category in questions.keys():
        num+=1
        print(f"{num}. {category}")

def choose_category():
    display_categories(questions)
    while True:
        category = input("Оберіть категорію введучи її назву: ")
        if category.isalpha() and category.capitalize() in questions:
            return category.capitalize()
        else:
            print("Будь ласка, введіть правильну назву категорії.")
    
def ask_question(category, questions, score):
    question = random.choice(questions[category])
    print(question['Запитання'])
    
    start_time = time.time()
    user_answer = input("Ваша відповідь: ")
    end_time = time.time()
    
    elapsed_time = end_time - start_time
    
    if elapsed_time <= 10:
        if user_answer.lower() == question['Відповідь'].lower():
            print("Вірно!")
            return True
        else:
            print(f"Неправильно. Правильна відповідь: {question['Відповідь']}")
            score += 1
            return False
    else:
        print("Час вийшов!")
        score += 1
        return False

def play_quiz():
    score = 0
    category = choose_category()
    
    while True:
        if not questions[category]:
            print("Усі питання в цій категорії вичерпано.")
            break

        correct_answer = ask_question(category, questions, score)

        if correct_answer:
            score += 1

        print(f"Ваш поточний бал: {score}")
        
        next_question = input("Бажаєте відповісти на наступне питання? (Так/Ні): ").lower()
        if next_question != 'так':
            break

    print(f"Гра завершена. Ваш загальний бал: {score}")

if __name__ == "__main__":
    print("Ласкаво просимо до Вікторини Знань!")
    
    # Категорії та запитання
questions = {
    'Історія': [
        {'Запитання': 'В якому році відбулася Велика Жовтневська соціалістична революція?', 'Відповідь': '1917'},
        {'Запитання': 'Хто був президентом США під час Другої світової війни?', 'Відповідь': 'Франклін Рузвельт'},
        {'Запитання': 'Що визначає термін "Ренесанс"?', 'Відповідь': 'Відродження'},
        {'Запитання': 'Яка країна стала першою, яка отримала незалежність в Латинській Америці?', 'Відповідь': 'Гаїті'},
        {'Запитання': 'Хто був фараоном під час будівництва піраміди Хеопса?', 'Відповідь': 'Хуфу'},
        {'Запитання': 'Як називалася перша космічна станція, виведена людиною на орбіту?', 'Відповідь': 'Мір'},
        {'Запитання': 'Коли завершилася Перша світова війна?', 'Відповідь': '1918'},
        {'Запитання': 'Хто був першим президентом Сполучених Штатів Америки?', 'Відповідь': 'Джордж Вашингтон'},
        {'Запитання': 'Який китайський філософ вважається автором "Арт-цзінь"?', 'Відповідь': 'Конфуцій'},
        {'Запитання': 'Хто написав "Іліаду" і "Одіссею"?', 'Відповідь': 'Гомер'},
    ],
    'Наука': [
        {'Запитання': 'Який хімічний елемент позначається символом "O"?', 'Відповідь': 'Кисень'},
        {'Запитання': 'Як називається найбільший орган людини?', 'Відповідь': 'Шкіра'},
        {'Запитання': 'Яка гравітаційна константа використовується в фізиці?', 'Відповідь': '6.67430e-11 м³ кг⁻¹ с⁻²'},
        {'Запитання': 'Яка хімічна реакція відбувається під час горіння?', 'Відповідь': 'Окиснення'},
        {'Запитання': 'Що вивчає ботаніка?', 'Відповідь': 'Рослини'},
        {'Запитання': 'Що визначає другий закон Ньютона?', 'Відповідь': 'Взаємодія тіл'},
        {'Запитання': 'Як називається найменший елементарний частинка атома?', 'Відповідь': 'Кварк'},
        {'Запитання': 'Що вивчає астрофізика?', 'Відповідь': 'Космос'},
        {'Запитання': 'Що таке ДНК?', 'Відповідь': 'Дезоксирибонуклеїнова кислота'},
        {'Запитання': 'Хто формулював закони руху планет?', 'Відповідь': 'Кеплер'},
    ],
    'Спорт': [
        {'Запитання': 'Яка команда перемогла в останньому Чемпіонаті світу з футболу?', 'Відповідь': 'Франція'},
        {'Запитання': 'Хто вважається найкращим баскетболістом усіх часів?', 'Відповідь': 'Майкл Джордан'},
        {'Запитання': 'Яка країна проведе наступні Олімпійські ігри?', 'Відповідь': 'Франція'},
        {'Запитання': 'Коли відбувся перший сучасний Олімпійський турнір?', 'Відповідь': '1896'},
        {'Запитання': 'Яка команда виграла найбільше золотих медалей на літніх Олімпійських іграх?', 'Відповідь': 'США'},
        {'Запитання': 'Хто є рекордсменом за кількістю виграних титулів у Формулі-1?', 'Відповідь': 'Льюіс Хемілтон'},
        {'Запитання': 'Яка країна є рекордсменом з виграшів Кубка Девіса в тенісі?', 'Відповідь': 'США'},
        {'Запитання': 'Який вид спорту представлений Формулою-1?', 'Відповідь': 'Автогонки'},
        {'Запитання': 'Хто виграв найбільше золотих медалей на Олімпійських іграх?', 'Відповідь': 'Майкл Фелпс'},
        {'Запитання': 'Що означає термін "Голлівудський хром"?', 'Відповідь': 'Дзеркальне відображення власного успіху в розвагах і шоу-бізнесі'},
    ],
    'Мистецтво': [
        {'Запитання': 'Хто написав картину "Мона Ліза"?', 'Відповідь': 'Леонардо да Вінчі'},
        {'Запитання': 'Хто з живописців представляє стилізований період в іскусстві Ренесансу?', 'Відповідь': 'Рафаель Санті'},
        {'Запитання': 'Яка техніка виготовлення скульптури полягає у вирізуванні матеріалу?', 'Відповідь': 'Ліплення'},
        {'Запитання': 'Хто є автором симфонії "Дев\'ята"?', 'Відповідь': 'Людвіг ван Бетховен'},
        {'Запитання': 'Що таке фреска?', 'Відповідь': 'Живописна техніка, в якій фарба наноситься на вологий штукатурку'},
        {'Запитання': 'Які кольори входять до триадного кольорового кола?', 'Відповідь': 'Червоний, жовтий, синій'},
        {'Запитання': 'Хто є автором скульптури "Давид"?', 'Відповідь': 'Мікеланджело'},
        {'Запитання': 'Що таке готична архітектура?', 'Відповідь': 'Стиль в архітектурі, який розвивався у середньовіччі'},
        {'Запитання': 'Яке іскусство використовує фігури з віскози?', 'Відповідь': 'Мадам Тюссо створила воскові фігури'},
        {'Запитання': 'Що означає термін "абстракціонізм" в мистецтві?', 'Відповідь': 'Напрям в образотворчому мистецтві, яке не зображує конкретних предметів або сцен, а лише ідеї і емоції'},
    ],
    'Технології': [
        {'Запитання': 'Що таке штучний інтелект?', 'Відповідь': 'Галузь комп\'ютерних наук, яка займається створенням програм і систем, що можуть виконувати завдання, які зазвичай вимагають людського інтелекту'},
        {'Запитання': 'Що таке блокчейн?', 'Відповідь': 'Технологія, яка дозволяє створювати і управляти розподіленими базами даних'},
        {'Запитання': 'Яка компанія випускає операційну систему Windows?', 'Відповідь': 'Microsoft'},
        {'Запитання': 'Що означає термін "інтернет речей" (IoT)?', 'Відповідь': 'Мережа фізичних пристроїв, які з\'єднані через інтернет і можуть взаємодіяти між собою'},
        {'Запитання': 'Хто винахідник електричного струму?', 'Відповідь': 'Нікола Тесла'},
        {'Запитання': 'Що таке віртуальна реальність?', 'Відповідь': 'Середовище, яке створено за допомогою комп\'ютера та віртуальної технології, в якому користувач може взаємодіяти з імітованим оточенням'},
        {'Запитання': 'Яка компанія випускає смартфониiPhone 13 Pro Max в 2023 році?', 'Відповідь': 'Apple'},
        {'Запитання': 'Що таке програмування?', 'Відповідь': 'Процес створення програмного забезпечення за допомогою визначення і послідовного виконання алгоритмів'},
        {'Запитання': 'Яка компанія є найбільшою виробницею процесорів для комп\'ютерів?', 'Відповідь': 'Intel'},
        {'Запитання': 'Що таке хмарні технології?', 'Відповідь': 'Використання інтернет-ресурсів для зберігання та обробки даних, замість локальних серверів чи персональних комп\'ютерів'},
        {'Запитання': 'Хто створив перший веб-браузер у світі?', 'Відповідь': 'Тім Бернерс-Лі'},
        {'Запитання': 'Що означає термін "штучний інтелект"?', 'Відповідь': 'Здатність комп\'ютерної системи виконувати завдання, які зазвичай вимагають людського інтелекту'},
        {'Запитання': 'Яка технологія використовується для бездротового передавання даних між пристроями?', 'Відповідь': 'Bluetooth'},
        {'Запитання': 'Що таке кібербезпека?', 'Відповідь': 'Заходи та технології, спрямовані на захист комп\'ютерних систем, мереж та даних від кіберзагроз'},
        {'Запитання': 'Хто є засновником компанії Tesla Motors?', 'Відповідь': 'Ілон Маск'},
        {'Запитання': 'Яка країна виробляє найбільше сонячних батарей у світі?', 'Відповідь': 'Китай'}
    ]
}

play_quiz()

